import React from 'react';
import { Layout, Row, Col, Grid } from 'antd';
const { useBreakpoint } = Grid;

export const Description = () => {
    const smallScreen = !useBreakpoint().lg;
    return (
        <div style={{
            margin:"5px",
            width:"100%",
            padding:"10px",
            paddingRight:"15px",
            paddingLeft:"15px",
            paddingBottom:"5px",
            backgroundColor:"#484767",
            borderRadius:"5px"
        }}>
            <p style={{textAlign:"justify"}}>
            DEX.MN нь дэлхийн хамгийн хүчирхэг блокчэйн сүлжээ болох Solana сүлжээн дээр ажиллаж буй Serum DEX -н Монгол орчуулга юм. Serum DEX нь өөрөө 100% блокчэйн сүлжээн дээр ажилладаг "Decentralized Exchange" бөгөөд уг арилжааны платформыг ажиллуулдаг байгууллага гэж байхгүй. Бүх арилжаа нь блокчэйн сүлжээнд байрлуулсан програмын тусламжтайгаар нэг хэрэглэгчийн хэтэвчээс нөгөө хэрэглэгчийн хэтэвч хооронд шууд хийгддэг буюу P2P горимоор ажилладаг. Ингэсэнээр уламжлалт арилжааны биржүүд дээр гардаг хүний хүчин зүйлээс (орлого, зарлага хүлээх, баталгаажуулалт хүлээх гэх мэт) шалтгаалах хүндрэлүүд үгүй болно. Түүнийгээ дагаад арилжаанд оролцох бүх үүрэг хариуцлага нь танд өөрт тань очих бөгөөд буруу дансруу шилжүүлэх гэх мэт санамсаргүй байдлаар өөрийн крипто ассетыг алдсан тохиолдолд эргүүлэн олж авах боломжгүй юм. Та арилжаанд оролцохоос өмнө Serum DEX- н гарын авлага материалуудтай сайтар танилцаж байж арилжаанд оролцох ёстойг анхааруулж байна. 
Дээр хэлсэнчлэн DEX.MN болон Serum DEX -г хариуцан ажиллуулдаг байгууллага гэж байхгүй бөгөөд, та анхаарал болгоомжгүй байдлаасаа болоод эсвэл төвлөрсөн бус арилжаанд оролцох мэдлэг дутмаг байдлаасаа болоод хохирол хүлээсэн бол DEX.MN хариуцахгүй болохыг анхааруулж байна! 
            </p>
        </div>
    )
}